In [1]:
import pandas as pd
import os

purchaseData = pd.read_csv("Resources/purchase_data.csv")

In [2]:
purchaseData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [3]:
purchaseData.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
uniquePurchData = purchaseData.nunique(axis=0)

uniquePurchData

Purchase ID    780
SN             576
Age             39
Gender           3
Item ID        183
Item Name      179
Price          145
dtype: int64

In [5]:
pd.DataFrame({
    "Total Players":[purchaseData['SN'].unique().size]
})

#print(type(purchaseData['SN'].unique().size))

   Total Players
0            576

In [6]:
purchaseData.shape[0]

780

In [7]:
formatResults = pd.DataFrame({
    "Number of Unique Items":[purchaseData['Item Name'].unique().size],
    "Average Price":[purchaseData['Price'].mean()],
    "Number of Purchases":[purchaseData.shape[0]],
    "Total Revenue":[purchaseData['Price'].sum()]
})

formatResults['Average Price'] = formatResults['Average Price'].map('${:,.2f}'.format)
formatResults['Total Revenue'] = formatResults['Total Revenue'].map('${:,.2f}'.format)

formatResults

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [ ]:
('{:.1f}'.format(purchaseData['Price'].mean()))

In [ ]:
import pandas as pd
df = pd.DataFrame([123.4567, 234.5678, 345.6789, 456.7890],
                  index=['foo','bar','baz','quux'],
                  columns=['cost'])
df['foo'] = df['cost']
df['cost'] = df['cost'].map('${:,.2f}'.format)
print(df)

In [ ]:
formatResults['Average Price'] = formatResults['Average Price'].map('${:,.2f}'.format)

In [ ]:
formatResults

In [ ]:
print(type(formatResults.iloc[0,1]))

print(type(formatResults['Average Price']))

In [ ]:
pd.DataFrame()

In [29]:
purchaseData.groupby(['Gender'])['SN'].value_counts()

Gender                 SN
Female                 Chamjask73     3
                       Ialallo29      3
                       Phyali88       3
                       Tyidaim51      3
                       Umolrian85     3
                                     ..
Other / Non-Disclosed  Haerithp41     1
                       Jiskirran77    1
                       Lirtim36       1
                       Rairith81      1
                       Sundim98       1
Name: SN, Length: 576, dtype: int64

In [35]:
purchaseData.drop_duplicates(subset='SN')['Gender'].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [38]:
gender_demographics = pd.DataFrame({
    'Total Count': purchaseData.drop_duplicates(subset='SN')['Gender'].value_counts(),
    'Percentage of Players': purchaseData.drop_duplicates(subset='SN')['Gender'].value_counts(normalize = True) * 100
})

gender_demographics['Percentage of Players'] = gender_demographics['Percentage of Players'].map('{:.2f}%'.format)

gender_demographics

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [39]:
purchaseData.groupby(['Gender'])['Age'].mean()

Gender
Female                   21.345133
Male                     22.917178
Other / Non-Disclosed    24.200000
Name: Age, dtype: float64

In [40]:
gender_analysis = pd.DataFrame({
    'Purchase Count': purchaseData['Gender'].value_counts(),
    'Average Purchase Price': purchaseData.groupby(['Gender'])['Price'].mean(),
    'Total Purchase Value': purchaseData.groupby(['Gender'])['Price'].sum(),
    'Avg Total Purchase per Person': purchaseData.groupby(['Gender', 'SN'])['Price'].sum().groupby(['Gender']).mean()
})

gender_analysis['Average Purchase Price'] = gender_analysis['Average Purchase Price'].map('${:,.2f}'.format)
gender_analysis['Total Purchase Value'] = gender_analysis['Total Purchase Value'].map('${:,.2f}'.format)
gender_analysis['Avg Total Purchase per Person'] = gender_analysis['Avg Total Purchase per Person'].map('${:,.2f}'.format)

gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [41]:
test = purchaseData.groupby(['Gender', 'SN'])['Price'].mean().groupby(['Gender']).mean()

test

#test.groupby(['Gender']).mean()

Gender
Female                   3.194835
Male                     3.014269
Other / Non-Disclosed    3.348636
Name: Price, dtype: float64

### Create bins and lables for each bin

In [42]:
bins = [0,10,15,20,25,30,35,40,purchaseData['Age'].max()]
group_names = ['<10',
               '10-14',
               '15-19',
               '20-24',
               '25-29',
               '30-34',
               '35-39',
               '40+'
]

### Bin data by Age and add it as an additional column

In [56]:
binned_age_group = pd.cut(purchaseData['Age'],bins,right=False)

purchaseData['Age Group'] = binned_age_group

purchaseData.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,"[20, 25)"
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,"[40, 45)"
2,2,Ithergue48,24,Male,92,Final Critic,4.88,"[20, 25)"
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,"[20, 25)"
4,4,Iskosia90,23,Male,131,Fury,1.44,"[20, 25)"

### Remove duplicate users

In [65]:
unique_SN_data = purchaseData.drop_duplicates(subset='SN')

print(unique_SN_data.count())

totalCount = unique_SN_data['SN'].count()

print(totalCount)

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
Age Group      575
dtype: int64
576

### Group data by Age Group and give count

In [66]:
grouped_purchase_data = unique_SN_data.groupby('Age Group')

grouped_purchase_data['SN'].count()

Age Group
[0, 10)      17
[10, 15)     22
[15, 20)    107
[20, 25)    258
[25, 30)     77
[30, 35)     52
[35, 40)     31
[40, 45)     11
Name: SN, dtype: int64

### Create new data frame containing Age Group count and formatted percentage of total user

In [67]:
age_demographics = pd.DataFrame({
    #'Total Count': grouped_purchase_data['SN'].count(),
    #'Total Count': purchaseData.groupby('Age Group')['SN'].nunique()
    'Total Count': purchaseData.drop_duplicates(subset='SN')['Age Group'].value_counts(),
    'Percentage of Players': purchaseData.drop_duplicates(subset='SN')['Age Group'].value_counts(normalize=True) * 100
   # 'Percentage of Players': grouped_purchase_data['SN'].count() / totalCount * 100
})

age_demographics['Percentage of Players'] = age_demographics['Percentage of Players'].map('{:.2f}%'.format)

age_demographics.sort_index()

          Total Count Percentage of Players
[0, 10)            17                 2.96%
[10, 15)           22                 3.83%
[15, 20)          107                18.61%
[20, 25)          258                44.87%
[25, 30)           77                13.39%
[30, 35)           52                 9.04%
[35, 40)           31                 5.39%
[40, 45)           11                 1.91%

In [68]:
purchasing_analysis_by_age = pd.DataFrame({
    'Purchase Count': purchaseData.groupby('Age Group')['Price'].count(),
    'Average Purchase Price': purchaseData.groupby('Age Group')['Price'].mean(),
    'Total Purchase Value': purchaseData.groupby('Age Group')['Price'].sum(),
    'Avg Total Purchase per Person': purchaseData.groupby(['Age Group','SN'])['Price'].sum().groupby(['Age Group']).mean() 
})

purchasing_analysis_by_age['Average Purchase Price'] = purchasing_analysis_by_age['Average Purchase Price'].map('${:,.2f}'.format)
purchasing_analysis_by_age['Total Purchase Value'] = purchasing_analysis_by_age['Total Purchase Value'].map('${:,.2f}'.format)
purchasing_analysis_by_age['Avg Total Purchase per Person'] = purchasing_analysis_by_age['Avg Total Purchase per Person'].map('${:,.2f}'.format)

purchasing_analysis_by_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
"[0, 10)",23,$3.35,$77.13,$4.54
"[10, 15)",28,$2.96,$82.78,$3.76
"[15, 20)",136,$3.04,$412.89,$3.86
"[20, 25)",365,$3.05,"$1,114.06",$4.32
"[25, 30)",101,$2.90,$293.00,$3.81
"[30, 35)",73,$2.93,$214.00,$4.12
"[35, 40)",41,$3.60,$147.67,$4.76
"[40, 45)",12,$3.04,$36.54,$3.32

In [69]:
purchaseData.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

In [70]:
purchaseData.groupby(['SN','Age Group'])['Price'].sum().groupby('Age Group').mean()

Age Group
[0, 10)     4.537059
[10, 15)    3.762727
[15, 20)    3.858785
[20, 25)    4.318062
[25, 30)    3.805195
[30, 35)    4.115385
[35, 40)    4.763548
[40, 45)    3.321818
Name: Price, dtype: float64

In [89]:
#purchaseData.sort_values(by=['SN']).head(20)
purchaseData.groupby(['Age Group','SN'])['Price'].sum().groupby(['Age Group']).value_counts()#count()

Age Group  Price
[0, 10)    2.05     1
           2.85     1
           3.08     1
           3.09     1
           3.47     1
                   ..
[40, 45)   4.00     1
           4.23     1
           4.40     1
           4.93     1
           5.19     1
Name: Price, Length: 445, dtype: int64

In [72]:
purchaseData.shape

(780, 8)

In [73]:
purchaseData.groupby(['SN']).count().sort_values(by=['Age'],ascending=False).head()

             Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Group
SN
Lisosia93              5    5       5        5          5      5          5
Iral74                 4    4       4        4          4      4          4
Idastidru52            4    4       4        4          4      4          4
Asur53                 3    3       3        3          3      3          3
Inguron55              3    3       3        3          3      3          3

In [90]:
top_spenders = pd.DataFrame({
    'Purchase Count': purchaseData.groupby(['SN'])['Purchase ID'].count(),
    'Average Purchase Price': purchaseData.groupby(['SN'])['Price'].mean(),
    'Total Purchase Value': purchaseData.groupby(['SN'])['Price'].sum()
})

top_spenders = top_spenders.sort_values(by=['Total Purchase Value'],ascending=False).head()

top_spenders['Average Purchase Price'] = top_spenders['Average Purchase Price'].map('${:,.2f}'.format)
top_spenders['Total Purchase Value'] = top_spenders['Total Purchase Value'].map('${:,.2f}'.format)

top_spenders

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [98]:
purchaseData.groupby(['Item ID','Item Name'])['Price'].last()

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Price, Length: 183, dtype: float64

In [113]:
most_popular_items = pd.DataFrame({
    'Purchase Count': purchaseData.groupby(['Item ID','Item Name'])['Purchase ID'].count(),
    'Item Price': purchaseData.groupby(['Item ID','Item Name'])['Price'].mean(),
    'Total Purchase Value': purchaseData.groupby(['Item ID','Item Name'])['Purchase ID'].count() * purchaseData.groupby(['Item ID','Item Name'])['Price'].mean()
})

#most_popular_items = most_popular_items.sort_values(by=['Purchase Count'],ascending=False)

#most_popular_items['Item Price'] = most_popular_items['Item Price'].map('${:,.2f}'.format)
#most_popular_items['Total Purchase Value'] = most_popular_items['Total Purchase Value'].map('${:,.2f}'.format)

#most_popular_items.sort_values(by=['Purchase Count'],ascending=False).head()

In [124]:
most_popular_items.sort_values(by=['Total Purchase Value'], ascending=False).applymap('${:.2f}'.format)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$12.00,$4.23,$50.76
82,Nirvana,$9.00,$4.90,$44.10
145,Fiery Glass Crusader,$9.00,$4.58,$41.22
92,Final Critic,$8.00,$4.88,$39.04
103,Singed Scalpel,$8.00,$4.35,$34.80
...,...,...,...,...
125,Whistling Mithril Warblade,$2.00,$1.00,$2.00
126,Exiled Mithril Longsword,$1.00,$2.00,$2.00
23,Crucifer,$1.00,$1.99,$1.99
104,Gladiator's Glaive,$1.00,$1.93,$1.93
42,The Decapitator,$1.00,$1.75,$1.75

In [100]:
purchaseData.groupby(['Item ID','Item Name'])['Price']

In [101]:
purchaseData.loc[purchaseData['Price'] > 3].groupby(['Item ID','Item Name'])['Price'].sum()

Item ID  Item Name
1        Crucifer                                         9.78
5        Putrid Fan                                      16.32
6        Rusty Skull                                      7.40
8        Purgatory, Gem of Regret                        11.79
11       Brimstone                                       18.25
                                                         ...
175      Woeful Adamantite Claymore                      13.44
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
180      Stormcaller                                      3.36
182      Toothpick                                       12.09
Name: Price, Length: 98, dtype: float64